[
    {
        "id": 1,
        "title": "ENGLISH EDUCATION IN CHILDREN",
        "desc": "English education to be given to the individual through pre-school education, which is the first stage of systematic education, is more important than basic education. Starting from developing a positive attitude towards English, becoming aware of different languages and cultures, it is very important as it constitutes the beginning of language education.The sample was from Bor district of Niğde province. Thirteen children in the 4-year-old group and ten children in the 5-year-old group receive education in an independent kindergarten affiliated with the Ministry of Education in the district. It consists of a total of thirty-five children, eleven of whom are between the ages of 1 and 6.During the training, children's attitudes and interests in the course were observed and the observations were recorded in a semi-structured observation form. The study involves choosing the object that corresponds to the given English word according to the topics and it was limited to measuring the level of saying the English equivalent of the object. Included in the sample, since none of the children spoke English at the beginning, no pretest was administered. Posttest after training, the data were analyzed as frequency distribution and percentage values. The test is one-on-one for every child. The data obtained by applying it were evaluated. In conclusion; the success rate in telling the English equivalent of the given object was 66.6% for 4-year-olds, 86.1% for 5-year-olds, and 78.7% for 6-year-olds. The success rate of showing a picture of the object was 74.1% for 4-year-olds, 93.5% for 5-year-olds, and 84.4% for 6-year-olds.",
        "date": "2023-08-01",
        "image": "borcelle4.jpg",
        "author": "John Duo"
    },
    {
        "id": 2,
        "title": "MOTOR DEVELOPMENT",
        "desc": "Psychomotor development in children and youth, the stages of development, size, factors affecting of the development and the research methods and basic concepts related of the development are vital importance in terms of meaning in society. Psychomotor development examines the metamorphosis starting from the previous phase of the ongoing child born lifelong occurring in behavior related to movement. This metamorphosis process is of particular requirements for physical education and healthy. In this essay has been explained is remarkable in maintaining academic integrity and examined in detail, before growth, learning, development, maturation and individuals living in the community's rules, values, self-expected roles, attitudes and patterns of behavior, skills required in social interaction, identity and acquire the sense of self, lived describes it offers how to contribute to the process of internalizing the culture as we explained above.",
        "date": "2023-09-05",
        "image": "borcelle2.jpg",
        "author": "John Duo"
    },
    {
        "id": 3,
        "title": "DIGITAL PARENTING ATTITUDES",
        "desc": "This study aimed to determine the relationship between parents' digital parenting attitudes and adolescents' internet addiction and emotion management skills. For this purpose, a study was conducted with 17-18 age group adolescents and their parents who were attending high school in Kayseri. Multi-stage sampling method was used when selecting the sample in the research. A total of 462 people, including 231 high school students and 231 parents, participated in the research. The sample size table determined by Krejcie and Morgan (1970) was used to select the sample size in the study. Research data were collected using the Digital Parenting Attitude Scale, Internet Addiction Scale-Short Form and Emotion Management Skills scales. According to the results of the normalization test applied to the research data, the findings were obtained by applying independent samples t-test, Mann Whitney U test, Kruscal Wallis H test, Pearson Correlation Analysis and simple linear regression analysis. As a result of the research, it was seen that there was a positive significant relationship between parents' digital parenting attitudes and internet addiction level. When looking at the relationship between emotional management skills and internet addiction level, it was seen that there was a negative, moderately significant relationship between the variables. It was also concluded that digital parental attitudes and adolescents' emotion management skills predict the level of internet addiction.",
        "date": "2023-10-10",
        "image": "borcelle3.jpg",
        "author": "John Duo"
    },
    {
        "id": 4,
        "title": "HYPERACTIVITY DISORDER",
        "desc": "The purpose of the present research is to compare the Turkish translations of school and home versions of the Scales for Diagnosing Attention-Deficit/Hyperactivity Disorder (SCALES) developed by Ryser and McConnell with respect to age and gender and to examine the correlation between the two scales. Method: The research was conducted with 102 teachers and parents of 891 children aged between 5.0 and 14.11 years. 656 scale forms of parents returned to us were included in the study. The teachers filled in teacher information form, child information form, SCALES-School Rating Scale and the Turkish version of Conners' Teacher Rating Scale. The parents filled in family information form, child information form and SCALES-Home Rating Scale and the Turkish version of the Conners' Home Rating Scale. Results: When SCALES-Home Rating Scale and SCALES-School Rating Scale scores of each age group were compared using t-test, it was observed that the difference in all sub-scale scores in the 5-9 age group was significant and it was also observed that in the 10-13 and 13+ age groups, the difference was significant only in the hyperactivity field. The correlation between SCALES-School Rating Scale and SCALES-Home Rating Scale was investigated. The correlation between sub-scales measuring the same abilities was found to be between 0.1 and 0.26. Conclusion: We assume that the Turkish version of the SCALES is a valid and reliable instrument for diagnosing ADHD. Since SCALES-Home Rating Scale scores were higher than SCALES-School Rating Scale scores and the correlation between the two scales was low, we assume that the objectivity of parents' ratings was limited.. Future validity studies on diagnosed children are needed.",
        "date": "2023-11-15",
        "image": "borcelle4.jpg",
        "author": "John Duo"
    },
    {
        "id": 5,
        "title": "PRAGMATIC LANGUAGE USE SKILLS",
        "desc": "A child may pronounce words clearly, have a large vocabulary, use long, complex sentences and correct grammar, and still have a communication problem if he or she has not mastered the rules for appropriate social language. It is known that functional or pragmatic language usage is not problematic for children who have completed normal language development process. We investigated whether children who have previously had receptive, expressive, or mixed language development delays will likely have problems in the use of pragmatic language after formal training. Materials and Methods: Two different subject groups composed of 67 children between the ages of 3-6 and classified as the ones with and without language delay. Children with language delay received educational treatment, auditory processing and speech and language training. Training was consisted of acoustic signal perception, auditory discrimination, auditory comprehension, conception training, phonological processing training, speech sound processing; and speech and language education. The average of training period was between 1 to 2 years. Their receptive and expressive language was tested at 6 month-interval. In children whose language development was compatible with chronological age, pragmatic language performance was evaluated. Children's pragmatic language usage skills were evaluated in both groups with Descriptive Pragmatics Profile (DPP) by using the rating technique (never, sometimes, often, always), in terms of the abilities (Conversational Routines and Skills) (CRS); Asking for, Giving and Responding to Information (AGRI). The Chi Square Test was used for statistical analysis. Results: Only four of nineteen items were similar (1. Waves or says hello/goodbye (in CRS part), 2. Demonstrates turn-taking rules during play and/or in classroom (in CRS part), 3. Gives and accepts hugs (in AGRI part) and 4. Asks for help from others (in AGRI part) (p>0.05), whereas the fifteen items were significantly different between groups (p<0.05). Conclusion: In our study, it was concluded that in DPP items which were not required the use of language (waves, demonstrates turn-taking rules during play, gives and accepts hugs, asks for help from others), there was no delay. We suggest that during the critical early language development period, children who have receptive and expressive language delays will also demonstrate delay in pragmatic language usage.",
        "date": "2023-09-20",
        "image": "borcelle5.jpg",
        "author": "John Duo"
    },
    {
        "id": 6,
        "title": "STORYTELLING SKILLS OF STUDENTS",
        "desc": "Narrative skills are important in terms of the development of children's academic skills (reading, writing, language). This research was planned to assess the story-telling skills of elementary school 1st, 2nd and 3rd grade pupils exhibiting typical growth with the objective of making a comparison between grades and genders. The study recruited 120 students enrolled in the 1st, 2nd and 3rd grades of an elementary school in the city center of Ankara. The wordless picture book (Frog, where are you?) was used in the research. A (Story-telling Assessment Questionnaire) was used to assess the stories that the children told. The SPSS 16.01 statistics program was used for the analysis of the data in the research. According to the results of the study, it was found that story-telling skills developed with age and that the rate of story comprehension of children is generally similar across ages and genders. It has been reported that the story-telling method is a useful way of assessing a child's language and academic qualities.",
        "date": "2023-12-01",
        "image":"borcelle6.jpg",
        "author":"John Duo"
    },
    {
        "id": 7,
        "title": "SOCIO CULTURAL FACTORSs",
        "desc": "This study was planned in order to analyze adolescent body image by age and gender, evaluate the relationship between adolescent body image and socio-cultural factors, and determine the extent to which variables such as age, gender, and Body Mass Index (BMI) can serve as predictors of the influential habits and strategies needed to achieve a better level of body satisfaction. Within this context, the data was collected using the following questionnaires: the Body Image and Body Size Variation Questionnaire; the Perceived Socio-Cultural Effects Concerning Body Image and Body Size Questionnaire; and a Data Form containing the demographic data. One thousand two hundred and eighty 7th, 8th, 9th, and 10th grade students were selected for the study using probabilistic, stratified, cluster sampling. The findings show a strong con elation between adolescent body image and socio-cultural factors, as well as between adolescent body image and the importance adolescents place on the media. From the regression analysis conducted using correlated variables, it was demonstrated that body satisfaction, habits and strategies with respect to body-building that pertain to adolescent body image can also be predicted by studying the attitudes and behaviours of the students' parents, peers, and the socio-cultural variables in evidence, such as the perceived effect of the media.",
        "date": "2023-10-15",
        "image":"borcelle7.jpg",
        "author":"John Duo"
    },
    {
        "id": 8,
        "title": "CHILD DEVELOPMENT",
        "desc": "Following children's development in physical, cognitive, social and emotional areas is very important to help the child complete the steps of healthy growth and development. In this article, we have included the universal developmental characteristics that children have acquired or may have acquired in these areas according to their age. However, it should not be forgotten that each child is unique and will complete the developmental stages according to his/her own readiness, genetic and environmental factors. Even children of the same age cannot be expected to have the same level of development.The developmental characteristics included in this information set generally outline the stages that babies and children go through from birth to 12 years of age. It is of great importance for caregivers to know and follow the child's developmental steps. In this way, adults caring for the child can provide information and support appropriate to the child's age, respond to his or her needs, and even recognize a possible abuse situation.",
        "date": "2023-11-20",
        "image":"borcelle8.jpg",
        "author":"John Duo"
    }
]